Revit 2017 API
AssetSet.Clear Method
Removes every asset from the set, rendering it empty.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Syntax
C#
public virtual void Clear()
Visual Basic
Public Overridable Sub Clear
Visual C++
public:
virtual void Clear()
See Also
AssetSet Class
Autodesk.Revit.Utility Namespace